In [1]:
### 放一张 E-R 图
### ipython-sql环境配置
### 参考 https://github.com/catherinedevlin/ipython-sql
! pip install ipython-sql

%load_ext sql

import pymysql 
pymysql.install_as_MySQLdb()

%sql mysql+pymysql://root:my-secret-pw@localhost
%sql create database if not exists students
%sql mysql+pymysql://root:my-secret-pw@localhost/students

/usr/bin/sh: 1: pip: not found
 * mysql+pymysql://root:***@localhost
1 rows affected.

In [2]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists student;

#创建student表
CREATE TABLE `student` ( 
    `sno` char(8) NOT NULL, 
    `sname` char(8) NOT NULL DEFAULT '佚名', 
    `age` tinyint DEFAULT NULL, 
    `sex` char(1) DEFAULT NULL, 
    `dno` char(8) DEFAULT NULL, 
    `supervisor` char(8) DEFAULT NULL, 
    PRIMARY KEY (`sno`), 
    KEY `student_dept_fk` (`dno`),
    KEY `student_teacher_fk` (`supervisor`), 
    CONSTRAINT `student_dept_fk` FOREIGN KEY (`dno`) REFERENCES `department` (`dno`), 
    CONSTRAINT `student_teacher_fk` FOREIGN KEY (`supervisor`) REFERENCES `teacher` (`dno`),
    CONSTRAINT `student_chk_1` CHECK (((`sex` = _utf8mb4'M') or (`sex` = _utf8mb4'F'))) 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [3]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists teacher;

#创建teacher表
CREATE TABLE `teacher` (
    `tno` char(8) NOT NULL, 
    `tname` char(8) NOT NULL DEFAULT '佚名', 
    `dno` char(8) DEFAULT NULL, 
    `salary` int DEFAULT NULL,
    `title` char(8) DEFAULT NULL, 
    PRIMARY KEY (`tno`), 
    KEY `teacher_dno_index` (`dno`),
    CONSTRAINT `teacher_dept_fk` FOREIGN KEY (`dno`) REFERENCES `department` (`dno`),
    CONSTRAINT `teacher_chk_1` CHECK ((`title` in (_utf8mb4'讲师',_utf8mb4'副教授',_utf8mb4'教授'))) 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [4]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists course;

#创建course表
CREATE TABLE `course` ( 
    `cno` char(8) NOT NULL, 
    `cname` char(8) NOT NULL,
    `pcno` char(8) DEFAULT NULL, 
    `credit` tinyint DEFAULT NULL,
    PRIMARY KEY (`cno`), 
    UNIQUE KEY `cname` (`cname`), 
    KEY `course_course_fk` (`pcno`), 
    CONSTRAINT `course_course_fk` FOREIGN KEY (`pcno`) REFERENCES `course` (`cno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists sc;

#创建选课表
CREATE TABLE `sc` (
    `sno` char(8) NOT NULL,
    `cno` char(8) NOT NULL,
    `grade` tinyint DEFAULT NULL,
    PRIMARY KEY (`sno`,`cno`), 
    KEY `sc_course_fk` (`cno`), 
    CONSTRAINT `sc_course_fk` FOREIGN KEY (`cno`) REFERENCES `course` (`cno`), 
    CONSTRAINT `sc_student_fk` FOREIGN KEY (`sno`) REFERENCES `student` (`sno`), 
    CONSTRAINT `sc_chk_1` CHECK (((`grade` is null) or (`grade` between 0 and 100))) 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;


set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists department;

#创建department表
CREATE TABLE `department` (
    `dno` char(8) NOT NULL, 
    `dname` char(8) NOT NULL DEFAULT '佚名', 
    `dean` char(8) DEFAULT NULL, 
    PRIMARY KEY (`dno`), 
    KEY `dept_teacher_fk` (`dean`), 
    CONSTRAINT `dept_teacher_fk` FOREIGN KEY (`dean`) REFERENCES `teacher` (`tno`) 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql

/*若多个表之间存在外键约束，不考虑顺序直接drop会失败，因此我们先取消外键约束的检查*/
set @@foreign_key_checks=0;

drop table if exists tc;

#创建授课表
CREATE TABLE `tc` ( 
    `tno` char(8) DEFAULT NULL, 
    `cno` char(8) DEFAULT NULL, 
    KEY `tc_teacher_fk` (`tno`), 
    KEY `tc_course_fk` (`cno`), 
    CONSTRAINT `tc_course_fk` FOREIGN KEY (`cno`) REFERENCES `course` (`cno`),
    CONSTRAINT `tc_teacher_fk` FOREIGN KEY (`tno`) REFERENCES `teacher` (`tno`) 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql 

set @@foreign_key_checks=0;

insert into teacher(tno,tname,dno,salary,title) values("t01","柏叶平","d01",10000,"副教授");
insert into teacher(tno,tname,dno,salary,title) values("t02","崔锡勇","d01",8000,"讲师");
insert into teacher(tno,tname,dno,salary,title) values("t03","邓辉","d02",12000,"教授");
insert into teacher(tno,tname,dno,salary,title) values("t04","郝小可","d02",10000,"副教授");
insert into teacher(tno,tname,dno,salary,title) values("t05","朱承斐","d03",8000,"讲师");
insert into teacher(tno,tname,dno,salary,title) values("t06","邓娜敏","d04",12000,"副教授");


insert into department(dno,dname,dean) values("d01","网络所","t01");
insert into department(dno,dname,dean) values("d02","语言所","t03");
insert into department(dno,dname,dean) values("d03","软件所","t05");
insert into department(dno,dname,dean) values("d04","结构所","t06");

insert into course(cno,cname,pcno,credit) values("c01","数据库原理","c05",2);
insert into course(cno,cname,pcno,credit) values("c02","操作系统","c05",3);
insert into course(cno,cname,pcno,credit) values("c03","计算机网络","c05",3);
insert into course(cno,cname,pcno,credit) values("c04","数据结构","c04",3);
insert into course(cno,cname,pcno,credit) values("c05","编译原理","c04",2);
insert into course(cno,cname,pcno,credit) values("c06","算法分析","c04",3);
insert into course(cno,cname,pcno,credit) values("c07","离散数学","c04",2);

insert into student(sno,sname,age,sex,dno,supervisor) values("s01",'张晓桐',18,"M","d01","t01");
insert into student(sno,sname,age,sex,dno,supervisor) values("s02","李晓峰",18,"M","d01","t01");
insert into student(sno,sname,age,sex,dno,supervisor) values("s03","刘莉",18,"F","d01","t01");
insert into student(sno,sname,age,sex,dno,supervisor) values("s04","朱英杰",19,"M","d01","t02");
insert into student(sno,sname,age,sex,dno,supervisor) values("s05","张子豪",18,"M","d01","t02");
insert into student(sno,sname,age,sex,dno,supervisor) values("s06","胡可琪",17,"F","d02","t03");
insert into student(sno,sname,age,sex,dno,supervisor) values("s07","李佳音",18,"F","d02","t03");
insert into student(sno,sname,age,sex,dno,supervisor) values("s08","陈凯琦",18,"M","d02","t04");
insert into student(sno,sname,age,sex,dno,supervisor) values("s09","刘英涛",19,"M","d02","t04");
insert into student(sno,sname,age,sex,dno,supervisor) values("s10","肖英俊",17,"M","d03","t05");
insert into student(sno,sname,age,sex,dno,supervisor) values("s11","桑家琦",18,"F","d03","t05");
insert into student(sno,sname,age,sex,dno,supervisor) values("s12","鲍泽峰",18,"M","d04","t06");


insert into sc(sno,cno,grade) values("s01","c01",85);
insert into sc(sno,cno,grade) values("s01","c02",56);
insert into sc(sno,cno,grade) values("s01","c03",85);
insert into sc(sno,cno,grade) values("s01","c04",85);
insert into sc(sno,cno,grade) values("s01","c05",67);
insert into sc(sno,cno,grade) values("s01","c06",85);
insert into sc(sno,cno,grade) values("s01","c07",85);
insert into sc(sno,cno,grade) values("s02","c01",88);
insert into sc(sno,cno,grade) values("s02","c03",65);
insert into sc(sno,cno,grade) values("s03","c01",92);
insert into sc(sno,cno,grade) values("s03","c03",NULL);
insert into sc(sno,cno,grade) values("s04","c02",87);
insert into sc(sno,cno,grade) values("s04","c04",82);
insert into sc(sno,cno,grade) values("s05","c02",79);
insert into sc(sno,cno,grade) values("s06","c03",90);
insert into sc(sno,cno,grade) values("s06","c05",NULL);
insert into sc(sno,cno,grade) values("s07","c03",82);
insert into sc(sno,cno,grade) values("s08","c04",83);
insert into sc(sno,cno,grade) values("s09","c04",88);
insert into sc(sno,cno,grade) values("s10","c05",75);
insert into sc(sno,cno,grade) values("s11","c05",86);
insert into sc(sno,cno,grade) values("s12","c05",81);

insert into tc(tno,cno) values("t01","c01");
insert into tc(tno,cno) values("t02","c02");
insert into tc(tno,cno) values("t03","c03");
insert into tc(tno,cno) values("t04","c04");
insert into tc(tno,cno) values("t05","c05");
insert into tc(tno,cno) values("t01","c06");
insert into tc(tno,cno) values("t04","c07");
insert into tc(tno,cno) values("t06",NULL);


set @@foreign_key_checks=1;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [9]:
#查询学生表中的所有信息。
%sql select * from student;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
12 rows affected.

[('s01', '张晓桐', 18, 'M', 'd01', 't01'),
 ('s02', '李晓峰', 18, 'M', 'd01', 't01'),
 ('s03', '刘莉', 18, 'F', 'd01', 't01'),
 ('s04', '朱英杰', 19, 'M', 'd01', 't02'),
 ('s05', '张子豪', 18, 'M', 'd01', 't02'),
 ('s06', '胡可琪', 17, 'F', 'd02', 't03'),
 ('s07', '李佳音', 18, 'F', 'd02', 't03'),
 ('s08', '陈凯琦', 18, 'M', 'd02', 't04'),
 ('s09', '刘英涛', 19, 'M', 'd02', 't04'),
 ('s10', '肖英俊', 17, 'M', 'd03', 't05'),
 ('s11', '桑家琦', 18, 'F', 'd03', 't05'),
 ('s12', '鲍泽峰', 18, 'M', 'd04', 't06')]

In [10]:
#查询选取课程的学生姓名、课程名称及成绩。
query="""
    select sname, cname, grade 
    from   student,course,sc 
    where  student.sno = sc.sno and course.cno = sc.cno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
22 rows affected.

[('张晓桐', '操作系统', 56),
 ('朱英杰', '操作系统', 87),
 ('张子豪', '操作系统', 79),
 ('张晓桐', '数据库原理', 85),
 ('李晓峰', '数据库原理', 88),
 ('刘莉', '数据库原理', 92),
 ('张晓桐', '数据结构', 85),
 ('朱英杰', '数据结构', 82),
 ('陈凯琦', '数据结构', 83),
 ('刘英涛', '数据结构', 88),
 ('张晓桐', '离散数学', 85),
 ('张晓桐', '算法分析', 85),
 ('张晓桐', '编译原理', 67),
 ('胡可琪', '编译原理', None),
 ('肖英俊', '编译原理', 75),
 ('桑家琦', '编译原理', 86),
 ('鲍泽峰', '编译原理', 81),
 ('张晓桐', '计算机网络', 85),
 ('李晓峰', '计算机网络', 65),
 ('刘莉', '计算机网络', None),
 ('胡可琪', '计算机网络', 90),
 ('李佳音', '计算机网络', 82)]

In [11]:
#查询薪资在4000-9000的老师姓名。
query="""
    select  tname
    from  teacher
    where salary  between  4000 and 9000;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
2 rows affected.

[('崔锡勇',), ('朱承斐',)]

In [12]:
#查询所有选课的学生（对选多门课程的学生不重复出现）。
%sql select  distinct  sno  from  sc;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
12 rows affected.

[('s01',),
 ('s02',),
 ('s03',),
 ('s04',),
 ('s05',),
 ('s06',),
 ('s07',),
 ('s08',),
 ('s09',),
 ('s10',),
 ('s11',),
 ('s12',)]

In [13]:
#查询学生表中的所有信息，按照年龄升序，姓名降序的方式排列。

query="""
    select  *
    from student
    order by age asc, sname  desc;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
12 rows affected.

[('s06', '胡可琪', 17, 'F', 'd02', 't03'),
 ('s10', '肖英俊', 17, 'M', 'd03', 't05'),
 ('s12', '鲍泽峰', 18, 'M', 'd04', 't06'),
 ('s08', '陈凯琦', 18, 'M', 'd02', 't04'),
 ('s11', '桑家琦', 18, 'F', 'd03', 't05'),
 ('s02', '李晓峰', 18, 'M', 'd01', 't01'),
 ('s07', '李佳音', 18, 'F', 'd02', 't03'),
 ('s01', '张晓桐', 18, 'M', 'd01', 't01'),
 ('s05', '张子豪', 18, 'M', 'd01', 't02'),
 ('s03', '刘莉', 18, 'F', 'd01', 't01'),
 ('s04', '朱英杰', 19, 'M', 'd01', 't02'),
 ('s09', '刘英涛', 19, 'M', 'd02', 't04')]

In [14]:
#查询学生的姓名、性别及出生日期，按照出生日期升序排列。

query="""
    select sname 姓名, sex  性别, 2019 - age  出生日期
    from student
    order by 2019 - age;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
12 rows affected.

[('朱英杰', 'M', 2000),
 ('刘英涛', 'M', 2000),
 ('张晓桐', 'M', 2001),
 ('李晓峰', 'M', 2001),
 ('刘莉', 'F', 2001),
 ('张子豪', 'M', 2001),
 ('李佳音', 'F', 2001),
 ('陈凯琦', 'M', 2001),
 ('桑家琦', 'F', 2001),
 ('鲍泽峰', 'M', 2001),
 ('胡可琪', 'F', 2002),
 ('肖英俊', 'M', 2002)]

In [15]:
#查询选修课程C1成绩比s01高的学生的学号。

query="""
    select s2.sno
    from      sc  as  s1,sc  as  s2
    where    s1.sno = 's01'
    and    s1.cno = 'c01'
    and    s2. cno = 'c01'
    and    s1.grade < s2.grade ;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
2 rows affected.

[('s02',), ('s03',)]

In [16]:
#查询工资比所在系主任高的老师的姓名及薪资。

query="""
    select   t1.tname,t1.salary
    from      teacher  t1,teacher  t2,department
    where    t1.dno = department.dno
    and   department.dean = t2.tno
    and  t1.salary >t2.salary;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
0 rows affected.

[]

In [17]:
#查询所有老师的教工号、姓名、工资、所教课程号
query="""
    select teacher.tno,tname,salary,cno
    from teacher left join tc on teacher.tno = tc.tno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
8 rows affected.

[('t01', '柏叶平', 10000, 'c01'),
 ('t01', '柏叶平', 10000, 'c06'),
 ('t02', '崔锡勇', 8000, 'c02'),
 ('t03', '邓辉', 12000, 'c03'),
 ('t04', '郝小可', 10000, 'c04'),
 ('t04', '郝小可', 10000, 'c07'),
 ('t05', '朱承斐', 8000, 'c05'),
 ('t06', '邓娜敏', 12000, None)]

In [18]:
#按照课程编号内连接表tc与sc。
query="""
    select *
    from sc inner join tc on sc.cno=tc.cno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
22 rows affected.

[('s01', 'c01', 85, 't01', 'c01'),
 ('s01', 'c02', 56, 't02', 'c02'),
 ('s01', 'c03', 85, 't03', 'c03'),
 ('s01', 'c04', 85, 't04', 'c04'),
 ('s01', 'c05', 67, 't05', 'c05'),
 ('s01', 'c06', 85, 't01', 'c06'),
 ('s01', 'c07', 85, 't04', 'c07'),
 ('s02', 'c01', 88, 't01', 'c01'),
 ('s02', 'c03', 65, 't03', 'c03'),
 ('s03', 'c01', 92, 't01', 'c01'),
 ('s03', 'c03', None, 't03', 'c03'),
 ('s04', 'c02', 87, 't02', 'c02'),
 ('s04', 'c04', 82, 't04', 'c04'),
 ('s05', 'c02', 79, 't02', 'c02'),
 ('s06', 'c03', 90, 't03', 'c03'),
 ('s06', 'c05', None, 't05', 'c05'),
 ('s07', 'c03', 82, 't03', 'c03'),
 ('s08', 'c04', 83, 't04', 'c04'),
 ('s09', 'c04', 88, 't04', 'c04'),
 ('s10', 'c05', 75, 't05', 'c05'),
 ('s11', 'c05', 86, 't05', 'c05'),
 ('s12', 'c05', 81, 't05', 'c05')]

In [19]:
#按照课程编号右连接表tc与sc。
%sql select * from sc right join tc on sc.cno=tc.cno;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
23 rows affected.

[('s03', 'c01', 92, 't01', 'c01'),
 ('s02', 'c01', 88, 't01', 'c01'),
 ('s01', 'c01', 85, 't01', 'c01'),
 ('s05', 'c02', 79, 't02', 'c02'),
 ('s04', 'c02', 87, 't02', 'c02'),
 ('s01', 'c02', 56, 't02', 'c02'),
 ('s07', 'c03', 82, 't03', 'c03'),
 ('s06', 'c03', 90, 't03', 'c03'),
 ('s03', 'c03', None, 't03', 'c03'),
 ('s02', 'c03', 65, 't03', 'c03'),
 ('s01', 'c03', 85, 't03', 'c03'),
 ('s09', 'c04', 88, 't04', 'c04'),
 ('s08', 'c04', 83, 't04', 'c04'),
 ('s04', 'c04', 82, 't04', 'c04'),
 ('s01', 'c04', 85, 't04', 'c04'),
 ('s12', 'c05', 81, 't05', 'c05'),
 ('s11', 'c05', 86, 't05', 'c05'),
 ('s10', 'c05', 75, 't05', 'c05'),
 ('s06', 'c05', None, 't05', 'c05'),
 ('s01', 'c05', 67, 't05', 'c05'),
 ('s01', 'c06', 85, 't01', 'c06'),
 ('s01', 'c07', 85, 't04', 'c07'),
 (None, None, None, 't06', None)]

In [20]:
#查询Left join excluding inner join部分的内容。
query="""
    select tc.*
    from tc left join sc on tc.cno =sc.cno
    where tc.cno is null;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('t06', None)]

In [21]:
#查询full join excluding inner部分的内容。 

query="""
    (select *
    from tc left join sc on tc.cno = sc.cno
    where sc.cno is null
    )
    union
    (select *
    from tc right join sc on tc.cno = sc.cno
    where tc.cno is null);
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('t06', None, None, None, None)]

In [22]:
#查询成绩最高的学生编号。
query="""
    select sno
    from sc
    where grade = (select max(grade)from sc);
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('s03',)]

In [23]:
#查询sc表中grade列不为空值的行数。

query="""select count(grade)
from sc;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[(20,)]

In [24]:
#查询sc表中的行数。
%sql select count(*) from sc;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[(22,)]

In [25]:
#查询sc表中grade列的总体标准差和样本方差。
%sql select stddev_pop(grade), stddev_samp(grade) from sc;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[(8.83798619596116, 9.06758251308357)]

In [26]:
#按照学号分组从表sc中查询学生的学号，最高成绩，最低成绩，及平均成绩。
query="""
    select sno, max(grade), min(grade), avg(grade)
    from sc
    group by sno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
12 rows affected.

[('s01', 85, 56, Decimal('78.2857')),
 ('s02', 88, 65, Decimal('76.5000')),
 ('s03', 92, 92, Decimal('92.0000')),
 ('s04', 87, 82, Decimal('84.5000')),
 ('s05', 79, 79, Decimal('79.0000')),
 ('s06', 90, 90, Decimal('90.0000')),
 ('s07', 82, 82, Decimal('82.0000')),
 ('s08', 83, 83, Decimal('83.0000')),
 ('s09', 88, 88, Decimal('88.0000')),
 ('s10', 75, 75, Decimal('75.0000')),
 ('s11', 86, 86, Decimal('86.0000')),
 ('s12', 81, 81, Decimal('81.0000'))]

In [27]:
#按照学号分组从表sc中查询最低分高于80的学生学号及平均成绩。
query="""
    select sno, avg(grade)
    from sc
    group by sno
    having min(grade) >= 80;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
8 rows affected.

[('s03', Decimal('92.0000')),
 ('s04', Decimal('84.5000')),
 ('s06', Decimal('90.0000')),
 ('s07', Decimal('82.0000')),
 ('s08', Decimal('83.0000')),
 ('s09', Decimal('88.0000')),
 ('s11', Decimal('86.0000')),
 ('s12', Decimal('81.0000'))]

In [28]:
#按照学号分组从表sc中查询最低分高于80的学生学号及平均成绩。
query="""
    select sno, avg(grade)
    from sc
    where grade >= 80
    group by sno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
10 rows affected.

[('s01', Decimal('85.0000')),
 ('s02', Decimal('88.0000')),
 ('s03', Decimal('92.0000')),
 ('s04', Decimal('84.5000')),
 ('s06', Decimal('90.0000')),
 ('s07', Decimal('82.0000')),
 ('s08', Decimal('83.0000')),
 ('s09', Decimal('88.0000')),
 ('s11', Decimal('86.0000')),
 ('s12', Decimal('81.0000'))]

In [29]:
#按照年龄进行分组，查询该年龄组性别为男性且数量大于4的学生年龄及数量。
query="""
    select age, count(sno)
    from student
    where sex = "M"
    group by age
    having count(*) > 4;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[(18, 5)]

In [30]:
#按照系名进行分组，查询各系的学生姓名，连接显示。
query="""
    select dname, group_concat(sname)
    from department, student
    where student.dno = department.dno
    group by dname;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
4 rows affected.

[('结构所', '鲍泽峰'),
 ('网络所', '张晓桐,李晓峰,刘莉,朱英杰,张子豪'),
 ('语言所', '胡可琪,李佳音,陈凯琦,刘英涛'),
 ('软件所', '肖英俊,桑家琦')]

In [31]:
#按照系名进行分组，查询各系的学生姓名，按照姓名升序连接显示。
query="""
    select dname, group_concat(sname order by sname)
    from department, student
    where student.dno = department.dno
    group by dname;
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
4 rows affected.

[('结构所', '鲍泽峰'),
 ('网络所', '刘莉,张子豪,张晓桐,朱英杰,李晓峰'),
 ('语言所', '刘英涛,李佳音,胡可琪,陈凯琦'),
 ('软件所', '桑家琦,肖英俊')]

In [32]:
#按照系名进行分组，查询各系的学生姓名，通过分隔符"|"连接显示。
query="""
    select dname, group_concat(sname separator "|")
    from department, student
    where student.dno = department.dno
    group by dname;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
4 rows affected.

[('结构所', '鲍泽峰'),
 ('网络所', '张晓桐|李晓峰|刘莉|朱英杰|张子豪'),
 ('语言所', '胡可琪|李佳音|陈凯琦|刘英涛'),
 ('软件所', '肖英俊|桑家琦')]

In [33]:
#在group分组的基础上再进行数据统计。按照性别分组，查询不同性别学生的平均年龄。 

query="""
    select sex, avg(age)
    from student
    group by sex with rollup;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
3 rows affected.

[('F', Decimal('17.7500')),
 ('M', Decimal('18.1250')),
 (None, Decimal('18.0000'))]

In [34]:
#查询学生姓名为张晓桐，朱英杰的全部信息
query="""
    select *
    from student
    where sname in ("张晓桐", "朱英杰");
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
2 rows affected.

[('s01', '张晓桐', 18, 'M', 'd01', 't01'), ('s04', '朱英杰', 19, 'M', 'd01', 't02')]

In [35]:
#查询结果
#查询选修课程编号为c01的学生姓名。
query="""
    select sname
    from student
    where
    sno in ( select sno
    from sc
    where cno = "c01"
    );
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
3 rows affected.

[('张晓桐',), ('李晓峰',), ('刘莉',)]

In [36]:
#查询选修了课程编号为c01及c02的学生学号。
query="""
    select sno
    from sc
    where
    sc.cno = "c01"
    and sc.sno in (
    select sno
    from sc
    where cno = "c02"
    );
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('s01',)]

In [37]:
#查询平均成绩最高的学生的学号。
query="""
    select sno
    from sc
    group by sno
    having
    avg(grade) >= all (
    select avg(grade)
    from sc
    group by sno
    );
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('s03',)]

In [38]:
#查询选择了课程编号c01的学生姓名。
query="""
    select sname
    from student
    where exists (
    select *
    from sc
    where cno = "c01" and sno = student.sno
    );

"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
3 rows affected.

[('张晓桐',), ('李晓峰',), ('刘莉',)]

In [39]:
#查询选择了课程编号为c01的学生，看其是否选择了课程c02。
query="""
    select sno
    from sc sc1
    where sc1.cno = "c01"
    and exists (
    select sno
    from sc
    where cno = "c02" and sno = sc1.sno
    );
"""
%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
1 rows affected.

[('s01',)]

In [40]:
#查询出只选修两门课程的学生学号和姓名
query="""
    select student.sno,student.Sname
    from sc,student
    where student.sno=sc.sno  
    GROUP BY sc.sno
    （填空）;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '（填空）' at line 1")
[SQL: select student.sno,student.Sname from sc,student where student.sno=sc.sno GROUP BY sc.sno （填空）;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [41]:
#查询平均成绩大于等于 85 的所有学生的学号、姓名和平均成绩
query="""
    select student.sno,student.Sname,t1.avgscore
    from student INNER JOIN 
                    (select sc.Sno ,AVG(sc.grade) as avgscore 
                    from sc 
                    GROUP BY sc.sno
                    (填空)) as t1 on student.Sno=t1.Sno;
"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students
(pymysql.err.OperationalError) (1305, 'FUNCTION sc.sno does not exist')
[SQL: select student.sno,student.Sname,t1.avgscore from student INNER JOIN (select sc.Sno ,AVG(sc.grade) as avgscore from sc GROUP BY sc.sno (填空)) as t1 on student.Sno=t1.Sno;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [42]:
#查询课程名称为「数据库原理」，且分数低于 90 的学生姓名和分数

query="""

"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students

In [43]:
#查询每门功成绩最好的前两名,成绩为空的去掉
query="""

"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students

In [44]:
#查询选修了全部课程的学生信息

query="""

"""

%sql $query

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost/students